#+TITLE:   doom-notes.org
#+DATE:    Started 2020-05-17
#+AUTHOR:  donagh mccarthy
#+FILEPATH: ~/PORTABLE_ENV/doom/xHELP/doom-notes.org
#+STARTUP: overview
#+options: il
#+tags:    help orgmode org-mode donaghs
#+EDITED:  2023-09-06; 2023-08-09; 2023-07-12; 2023-04-07; 2023-02-24; 2023-01-03; 2022-12-19; 2022-12-16; 2022-09-25


** yasnippets

webref:https://arjanvandergaag.nl/blog/using-yasnippet-in-emacs.html

   Yasnippet & Yasnippet-snippets
   [SPC] i s
  This is the "incrementally" snippet in text-mode.

[SPC] i s or just <s [TAB]


The following was a begin src block
#+BEGIN_SRC emacs-lisp
(defun great (name)
  (concat "Hello " name))

(great "Dolly")

#+END_SRC

#+RESULTS:
: Hello Dolly


(To execute: M-x org-babel-execute-source-block :: I made a keybinding to do this. It is Q )


<s and [TAB]

#+BEGIN_SRC emacs-lisp
(+ 11 43)
#+END_SRC

#+RESULTS:
: 54

ANOTHER EXAMPLE

#+BEGIN_SRC emacs-lisp
(message "hello Dolly")
(+ 222 (* 88 32))
#+END_SRC

#+RESULTS:
: 3038

Then press Q to get...
#+RESULTS:
: 3038



<l and [TAB]
#+BEGIN_EXPORT latex
/rarrow
#+END_EXPORT



appear
defamation

**** source code / literate programming
    To insert a snippet for source code: [SPC] i s and select begin_src

    Example 1 emacs-lisp
   #+BEGIN_SRC emacs-lisp
   (+ 3 58)

   #+END_SRC

   #+RESULTS:
   : 61

   and then pressing C-x C-e OR C-c C-c will show 61 in the mini buffer

    Example 2 python
   #+BEGIN_SRC python
   print(3+43+43+4)


   #+END_SRC

   #+RESULTS:
   : None

   C-c C-c inside the code block (not working)
   #+RESULTS:
   : None

*** multiple org files
   Suppose you have many files that you want org-mode to 'watch'. In the dotspacemacs-configuration-layers of .spacemacs:
   Say, work, school and home.
#+BEGIN_SRC elisp
(setq org-agenda-files (list "/home/donagh/org/work.org"
                             "/home/donagh/org/school.org"
                             "/home/donagh/org/home.org"))
#+END_SRC

#+RESULTS:
| /home/donagh/org/work.org | /home/donagh/org/school.org | /home/donagh/org/home.org |

Press C-c a t to enter the global todo list.

